---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType.ShowPredefined
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType
source: html/fc966bf7-766a-f6ec-2afe-4d1c19876e65.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramFenceType.ShowPredefined

Show fence only for points that have flag ValueAtPointFlags::DisplayFence